Tekla Open API Reference for Tekla Structures 2025
DetailMark Constructor
Overload List
Name | Description
DetailMark(View, Point, Point, Point)
 Creates a new detail mark instance with the given positions.
DetailMark(View, Point, Point, Point, DetailMark.DetailMarkAttributes)
 Creates a new detail mark instance with the given positions and attributes.
Top
See Also
Reference
DetailMark Class
Tekla.Structures.Drawing Namespace